package com.github.kongpf8848.shuihu.activity;

public class Constants {


    public static final String[] NAME_LIST = {
            "宋江", "卢俊义", "吴用", "公孙胜", "关胜", "林冲", "秦明", "呼延灼",
            "花荣", "柴进", "李应", "朱仝", "鲁智深", "武松", "董平", "张清",
            "杨志", "徐宁", "索超", "戴宗", "刘唐", "李逵", "史进", "穆弘",
            "雷横", "李俊", "阮小二", "张横", "阮小五", "张顺", "阮小七", "杨雄",
            "石秀", "解珍", "解宝", "燕青", "朱武", "黄信", "孙立", "宣赞",
            "郝思文", "韩滔", "彭玘", "单延圭", "魏定国", "萧让", "裴宣", "欧鹏",
            "邓飞", "燕顺", "杨林", "凌振", "蒋敬", "吕方", "郭盛", "安道全",
            "皇甫端", "王英", "扈三娘", "鲍旭", "樊瑞", "孔明", "孔亮", "项充",
            "李衮", "金大坚", "马麟", "童威", "童猛", "孟康", "侯健", "陈达",
            "杨春", "郑天寿", "陶宗旺", "宋清", "乐和", "龚旺", "丁得孙", "穆春",
            "曹正", "宋万", "杜迁", "薛永", "施恩", "李忠", "周通", "汤隆",
            "杜兴", "邹渊", "邹润", "朱贵", "朱富", "蔡福", "蔡庆", "李立",
            "李云", "焦挺", "石勇", "孙新", "顾大嫂", "张青", "孙二娘", "王定六",
            "郁保四", "白胜", "时迁", "段景住"

    };
    public static final String[] NICK_LIST = {
            "呼保义", "玉麒麟", "智多星", "入云龙", "大刀", "豹子头", "霹雳火", "双鞭",
            "小李广", "小旋风", "扑天雕", "美髯公", "花和尚", "行者", "双枪将", "没羽箭",
            "青面兽", "金枪手", "急先锋", "神行太保", "赤发鬼", "黑旋风", "九纹龙", "没遮拦",
            "插翅虎", "混江龙", "立地太岁", "船火儿", "短命二郎", "浪里白条", "活阎罗", "病关索",
            "拼命三郎", "两头蛇", "双尾蝎", "浪子", "神机军师", "镇三山", "病尉迟", "丑郡马",
            "井木犴", "百胜将", "天目将", "圣水将", "神火将", "圣手书生", "铁面孔目", "摩云金翅",
            "火眼狻猊", "锦毛虎", "锦豹子", "轰天雷", "神算子", "小温侯", "赛仁贵", "神医",
            "紫髯伯", "矮脚虎", "一丈青", "丧门神", "混世魔王", "毛头星", "独火星", "八臂哪吒",
            "飞天大圣", "玉臂匠", "铁笛仙", "出洞蛟", "翻江蜃", "玉幡竿", "通臂猿", "跳涧虎",
            "白花蛇", "白面郎君", "九尾龟", "铁扇子", "铁叫子", "花项虎", "中箭虎", "小遮拦",
            "操刀鬼", "云里金刚", "摸着天", "病大虫", "金眼彪", "打虎将", "小霸王", "金钱豹子",
            "鬼脸儿", "出林龙", "独角龙", "旱地忽律", "笑面虎", "铁臂膊", "一枝花", "催命判官",
            "青眼虎", "没面目", "石将军", "小尉迟", "母大虫", "菜园子", "母夜叉", "活闪婆",
            "险道神", "白日鼠", "鼓上骚", "金毛犬"

    };
    public static final String[] STAR_LIST = {
            "天魁星", "天罡星", "天机星", "天闲星", "天勇星", "天雄星", "天猛星", "天威星",
            "天英星", "天贵星", "天富星", "天满星", "天孤星", "天伤星", "天立星", "天捷星",
            "天暗星", "天佑星", "天空星", "天速星", "天异星", "天杀星", "天微星", "天究星",
            "天退星", "天寿星", "天剑星", "天平星", "天罪星", "天损星", "天败星", "天牢星",
            "天慧星", "天暴星", "天哭星", "天巧星", "地魁星", "地煞星", "地勇星", "地杰星",
            "地雄星", "地威星", "地英星", "地奇星", "地猛星", "地文星", "地正星", "地阔星",
            "地阖星", "地强星", "地暗星", "地轴星", "地会星", "地佐星", "地佑星", "地灵星",
            "地兽星", "地微星", "地彗星", "地暴星", "地然星", "地猖星", "地狂星", "地飞星",
            "地走星", "地巧星", "地明星", "地进星", "地退星", "地满星", "地遂星", "地周星",
            "地隐星", "地异星", "地理星", "地俊星", "地乐星", "地捷星", "地速星", "地镇星",
            "地羁星", "地魔星", "地妖星", "地幽星", "地伏星", "地僻星", "地空星", "地孤星",
            "地全星", "地短星", "地角星", "地囚星", "地藏星", "地平星", "地损星", "地奴星",
            "地察星", "地恶星", "地丑星", "地数星", "地阴星", "地刑星", "地壮星", "地劣星",
            "地健星", "地耗星", "地贼星", "地狗星"
    };
    public static final String[] SORT_LIST = {
            "第一", "第二", "第三", "第四", "第五", "第六", "第七", "第八",
            "第九", "第十", "第十一", "第十二", "第十三", "第十四", "第十五", "第十六",
            "第十七", "第十八", "第十九", "第二十", "第二十一", "第二十二", "第二十三", "第二十四",
            "第二十五", "第二十六", "第二十七", "第二十八", "第二十九", "第三十", "第三十一", "第三十二",
            "第三十三", "第三十四", "第三十五", "第三十六", "第三十七", "第三十八", "第三十九", "第四十",
            "第四十一", "第四十二", "第四十三", "第四十四", "第四十五", "第四十六", "第四十七", "第四十八",
            "第四十九", "第五十", "第五十一", "第五十二", "第五十三", "第五十四", "第五十五", "第五十六",
            "第五十七", "第五十八", "第五十九", "第六十", "第六十一", "第六十二", "第六十三", "第六十四",
            "第六十五", "第六十六", "第六十七", "第六十八", "第六十九", "第七十", "第七十一", "第七十二",
            "第七十三", "第七十四", "第七十五", "第七十六", "第七十七", "第七十八", "第七十九", "第八十",
            "第八十一", "第八十二", "第八十三", "第八十四", "第八十五", "第八十六", "第八十七", "第八十八",
            "第八十九", "第九十", "第九十一", "第九十二", "第九十三", "第九十四", "第九十五", "第九十六",
            "第九十七", "第九十八", "第九十九", "第一百", "第一百零一", "第一百零二", "第一百零三", "第一百零四",
            "第一百零五", "第一百零六", "第一百零七", "第一百零八"
    };

}
